---
kind: property
id: P:Autodesk.Revit.DB.Material.UseRenderAppearanceForShading
zh: 材质、材料
source: html/6cba11a1-b384-c588-3e88-526d3229c6c1.htm
---
# Autodesk.Revit.DB.Material.UseRenderAppearanceForShading Property

**中文**: 材质、材料

True to use the render appearance settings for shaded view appearance;
 false to use the material's color and transparency value for shaded view appearance.

## Syntax (C#)
```csharp
public bool UseRenderAppearanceForShading { get; set; }
```